In [1]:
!pip install pyspark

Collecting pyspark
  Using cached pyspark-3.3.2.tar.gz (281.4 MB)
  Preparing metadata (setup.py) ... done
Collecting py4j==0.10.9.5
  Using cached py4j-0.10.9.5-py2.py3-none-any.whl (199 kB)
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.3.2-py2.py3-none-any.whl size=281824010 sha256=3aa3c429ea831347625acced2cc399d94dda2f7c532b5877646292a6a824b93b
  Stored in directory: /Users/koffeebook/Library/Caches/pip/wheels/47/69/84/c7c7776e2287a654536f5cba7dc54c904c03aa2c3e29206f0f
Successfully built pyspark
Installing collected packages: py4j, pyspark
Successfully installed py4j-0.10.9.5 pyspark-3.3.2

In [5]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.0.0-cp311-cp311-macosx_10_9_x86_64.whl (11.6 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 11.6/11.6 MB 45.3 MB/s eta 0:00:0000:0100:01
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/koffeebook/opt/anaconda3/envs/myenv/lib/python3.11/site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1
  Downloading pytz-2023.3-py2.py3-none-any.whl (502 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 502.3/502.3 kB 42.3 MB/s eta 0:00:00
Collecting tzdata>=2022.1
  Downloading tzdata-2023.3-py2.py3-none-any.whl (341 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 341.8/341.8 kB 44.8 MB/s eta 0:00:00
Collecting numpy>=1.21.0
  Downloading numpy-1.24.2-cp311-cp311-macosx_10_9_x86_64.whl (19.8 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 19.8/19.8 MB 39.3 MB/s eta 0:00:0000:0100:01
Requirement already satisfied: six>=1.5 in /Users/koffeebook/opt/anaconda3/envs/myenv/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-1.24.2 pandas-2.0.0 pytz-2023.3 tzdata-2023.3

In [1]:
from pyspark.sql import SparkSession

In [29]:
from pyspark.sql.functions import *

In [30]:
from pyspark.sql.types import *

In [2]:
spark = SparkSession.builder.appName("pysparktest").getOrCreate()

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

23/04/13 00:47:21 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [3]:
spark

In [6]:
import pandas as pd

In [64]:
list1 = ['apple', 'mango', 'apple', 'banana', 'mango']

d={}
for i in list1:
    if i in d:
        d[i]+=1
    else:
        d[i]=1
print(d)

{'apple': 2, 'mango': 2, 'banana': 1}

In [83]:
from collections import defaultdict
s = set()
for i in list1:
    count = 0
    
    if i not in s:
        for j in list1:
            if i == j:
                count+=1
        print(i,count)
        s.add(i)

apple 2
mango 2
banana 1

In [84]:
import os 
os.listdir()

['.DS_Store',
 'Pyspark',
 'practice.py',
 'pyspark_test.py',
 'test2.py',
 'restaurant_orders.csv',
 'Kafka',
 '.ipynb_checkpoints',
 'Pyspark_Python.ipynb']

In [87]:
df1 = pd.read_csv("restaurant_orders.csv")
df1

,Order Number,Order Date,Item Name,Quantity,Product Price,Total products
0,16118,03/08/2019 20:25,Plain Papadum,2,0.80,6
1,16118,03/08/2019 20:25,King Prawn Balti,1,12.95,6
2,16118,03/08/2019 20:25,Garlic Naan,1,2.95,6
3,16118,03/08/2019 20:25,Mushroom Rice,1,3.95,6
4,16118,03/08/2019 20:25,Paneer Tikka Masala,1,8.95,6
...,...,...,...,...,...,...
74813,2518,18/05/2016 18:53,House Red wine 75cl,2,17.95,7
74814,2503,14/05/2016 19:28,House Red wine 75cl,2,17.95,6
74815,2467,10/05/2016 13:18,House Red wine 75cl,2,17.95,9
74816,2249,07/04/2016 19:04,House white wine 75cl,1,17.95,6
74817,1403,02/10/2015 17:29,House Red wine 75cl,1,17.95,9

In [52]:
pd.merge(df1,df2,how="outer")

  name  marks  marks2
0    a   34.0    34.0
1    b   50.0    20.0
2    c   45.0     NaN
3    d   12.0    12.0
4    e   50.0     NaN
5    f   46.0    18.0
6    h    NaN    22.0
7    i    NaN    21.0

In [20]:
def res(marks):
    if marks>30:
        return "Pass"
    else:
        return "Fail"

In [21]:
df['result'] = df['marks2'].apply(lambda x:res(x))
df

  name  marks2 result
0    a      34   Pass
1    b      50   Pass
2    h      22   Fail
3    d      12   Fail
4    e      12   Fail
5    i      34   Pass

In [17]:
df = spark.read.option("header","true").csv("restaurant_orders.csv")

In [18]:
df.show()

+------------+----------------+--------------------+--------+-------------+--------------+
|Order Number|      Order Date|           Item Name|Quantity|Product Price|Total products|
+------------+----------------+--------------------+--------+-------------+--------------+
|       16118|03/08/2019 20:25|       Plain Papadum|       2|          0.8|             6|
|       16118|03/08/2019 20:25|    King Prawn Balti|       1|        12.95|             6|
|       16118|03/08/2019 20:25|         Garlic Naan|       1|         2.95|             6|
|       16118|03/08/2019 20:25|       Mushroom Rice|       1|         3.95|             6|
|       16118|03/08/2019 20:25| Paneer Tikka Masala|       1|         8.95|             6|
|       16118|03/08/2019 20:25|       Mango Chutney|       1|          0.5|             6|
|       16117|03/08/2019 20:17|          Plain Naan|       1|          2.6|             7|
|       16117|03/08/2019 20:17|       Mushroom Rice|       1|         3.95|             7|
|       16117|03/08/2019 20:17|Tandoori Chicken ...|       1|         4.95|             7|
|       16117|03/08/2019 20:17|     Vindaloo - Lamb|       1|         7.95|             7|
|       16117|03/08/2019 20:17|             Chapati|       1|         1.95|             7|
|       16117|03/08/2019 20:17|          Lamb Tikka|       1|         4.95|             7|
|       16117|03/08/2019 20:17|         Saag Paneer|       1|         5.95|             7|
|       16116|03/08/2019 20:09|          Aloo Chaat|       1|         4.95|             5|
|       16116|03/08/2019 20:09|      Chicken Pakora|       1|         5.95|             5|
|       16116|03/08/2019 20:09|Chicken Chilli Ga...|       1|         9.95|             5|
|       16116|03/08/2019 20:09|        Lamb Biryani|       1|         9.95|             5|
|       16116|03/08/2019 20:09|          Keema Naan|       1|         2.95|             5|
|       16115|03/08/2019 20:01|      Chicken Pakora|       1|         5.95|             7|
|       16115|03/08/2019 20:01|       Plain Papadum|       1|          0.8|             7|
+------------+----------------+--------------------+--------+-------------+--------------+
only showing top 20 rows

In [22]:
df.columns

['Order Number',
 'Order Date',
 'Item Name',
 'Quantity',
 'Product Price',
 'Total products']

In [25]:
df.summary().show()

+-------+------------------+----------------+--------------+------------------+-----------------+------------------+
|summary|      Order Number|      Order Date|     Item Name|          Quantity|    Product Price|    Total products|
+-------+------------------+----------------+--------------+------------------+-----------------+------------------+
|  count|             74818|           74818|         74818|             74818|            74818|             74818|
|   mean|  9115.63816193964|            null|          null|  1.24356438290251|5.286491886982787|  6.93143361223235|
| stddev|4052.2104520331745|            null|          null|0.7982073410496792|  3.3382213559897|3.9548324912473527|
|    min|             10000|01/01/2017 17:31|    Aloo Chaat|                 1|              0.5|                 1|
|    25%|            5590.0|            null|          null|               1.0|             2.95|               5.0|
|    50%|            9102.0|            null|          null|               1.0|             3.95|               6.0|
|    75%|           12630.0|            null|          null|               1.0|             8.95|               8.0|
|    max|              9999|31/12/2018 21:56|Vindaloo Sauce|                 9|             9.95|                 9|
+-------+------------------+----------------+--------------+------------------+-----------------+------------------+

In [26]:
df.count()

74818

In [63]:
df.groupBy(col("Item Name")).agg(sum(col("Quantity").cast(IntegerType())).alias("Total_orders")).orderBy(col("Total_orders").desc()).show(10)

+--------------------+------------+
|           Item Name|Total_orders|
+--------------------+------------+
|       Plain Papadum|       10648|
|          Pilau Rice|        6367|
|          Plain Naan|        4983|
|         Garlic Naan|        3318|
|          Plain Rice|        2964|
|        Onion Bhajee|        2749|
|       Mango Chutney|        2504|
|Chicken Tikka Masala|        2473|
|             Chapati|        1935|
|          Mint Sauce|        1840|
+--------------------+------------+
only showing top 10 rows

In [35]:
df.createOrReplaceTempView("Orders")

In [48]:
spark.sql("select * from Orders").show()

+------------+----------------+--------------------+--------+-------------+--------------+
|Order Number|      Order Date|           Item Name|Quantity|Product Price|Total products|
+------------+----------------+--------------------+--------+-------------+--------------+
|       16118|03/08/2019 20:25|       Plain Papadum|       2|          0.8|             6|
|       16118|03/08/2019 20:25|    King Prawn Balti|       1|        12.95|             6|
|       16118|03/08/2019 20:25|         Garlic Naan|       1|         2.95|             6|
|       16118|03/08/2019 20:25|       Mushroom Rice|       1|         3.95|             6|
|       16118|03/08/2019 20:25| Paneer Tikka Masala|       1|         8.95|             6|
|       16118|03/08/2019 20:25|       Mango Chutney|       1|          0.5|             6|
|       16117|03/08/2019 20:17|          Plain Naan|       1|          2.6|             7|
|       16117|03/08/2019 20:17|       Mushroom Rice|       1|         3.95|             7|
|       16117|03/08/2019 20:17|Tandoori Chicken ...|       1|         4.95|             7|
|       16117|03/08/2019 20:17|     Vindaloo - Lamb|       1|         7.95|             7|
|       16117|03/08/2019 20:17|             Chapati|       1|         1.95|             7|
|       16117|03/08/2019 20:17|          Lamb Tikka|       1|         4.95|             7|
|       16117|03/08/2019 20:17|         Saag Paneer|       1|         5.95|             7|
|       16116|03/08/2019 20:09|          Aloo Chaat|       1|         4.95|             5|
|       16116|03/08/2019 20:09|      Chicken Pakora|       1|         5.95|             5|
|       16116|03/08/2019 20:09|Chicken Chilli Ga...|       1|         9.95|             5|
|       16116|03/08/2019 20:09|        Lamb Biryani|       1|         9.95|             5|
|       16116|03/08/2019 20:09|          Keema Naan|       1|         2.95|             5|
|       16115|03/08/2019 20:01|      Chicken Pakora|       1|         5.95|             7|
|       16115|03/08/2019 20:01|       Plain Papadum|       1|          0.8|             7|
+------------+----------------+--------------------+--------+-------------+--------------+
only showing top 20 rows

In [49]:
spark.sql("describe Orders").show()

+--------------+---------+-------+
|      col_name|data_type|comment|
+--------------+---------+-------+
|  Order Number|   string|   null|
|    Order Date|   string|   null|
|     Item Name|   string|   null|
|      Quantity|   string|   null|
| Product Price|   string|   null|
|Total products|   string|   null|
+--------------+---------+-------+

In [62]:
spark.sql("select `Item Name`,sum(cast(Quantity as int)) as `Total Orders` from Orders group by `Item Name` order by `Total Orders` desc limit 10").show()

+--------------------+------------+
|           Item Name|Total Orders|
+--------------------+------------+
|       Plain Papadum|       10648|
|          Pilau Rice|        6367|
|          Plain Naan|        4983|
|         Garlic Naan|        3318|
|          Plain Rice|        2964|
|        Onion Bhajee|        2749|
|       Mango Chutney|        2504|
|Chicken Tikka Masala|        2473|
|             Chapati|        1935|
|          Mint Sauce|        1840|
+--------------------+------------+